{
  "opening": "Caro-Kann Defense",
  "key_mistakes": [
    {
      "move": "2. c6",
      "reason": "The move c6 is passive, allowing White to occupy the center. It does not contest the center as effectively as other moves.",
      "better_move": "e5",
      "type": "strategic"
    },
    {
      "move": "6. c5",
      "reason": "Inaccurate pawn move that doesn't develop pieces or challenge White's center effectively.",
      "better_move": "Bf5",
      "type": "strategic"
    },
    {
      "move": "24. Bg6",
      "reason": "This move allows White to strengthen their pawn structure and gain a significant advantage.",
      "better_move": "cxd4",
      "type": "strategic"
    },
    {
      "move": "25. h4",
      "reason": "Misses the opportunity to capture the pawn and solidify a central advantage.",
      "better_move": "dxc5",
      "type": "strategic"
    },
    {
      "move": "27. Nxd4",
      "reason": "This move loses material by allowing the opponent to capture a well-placed knight.",
      "better_move": "cxd4",
      "type": "tactical"
    },
    {
      "move": "50. a5",
      "reason": "This move weakens the pawn structure and allows White to gain a winning position.",
      "better_move": "g5",
      "type": "strategic"
    },
    {
      "move": "51. Na2",
      "reason": "Misplaces the knight and allows the opponent to gain control of the board.",
      "better_move": "Nb5",
      "type": "strategic"
    },
    {
      "move": "97. Rxh7",
      "reason": "This move does not contribute to promoting the remaining pawns or improving king safety.",
      "better_move": "a7",
      "type": "strategic"
    },
    {
      "move": "101. Rb7",
      "reason": "Misses a chance to create an immediate threat and simplify into a winning endgame.",
      "better_move": "Re7",
      "type": "tactical"
    }
  ],
  "themes": [
    "Caro-Kann Defense",
    "Pawn structure",
    "Central control",
    "Piece activity and development",
    "Endgame technique"
  ],
  "recommendations": [
    "Focus on controlling the center early in the game.",
    "Develop pieces actively to improve board control and coordination.",
    "Avoid unnecessary pawn moves that weaken your structure without gaining a compensating advantage.",
    "In endgames, prioritize pawn promotion and king safety.",
    "Review tactical motifs to recognize opportunities and threats more effectively."
  ]
}