{
  "opening": "Caro-Kann Defense",
  "key_mistakes": [
    {
      "move": "2. c6",
      "reason": "Played move c6 does not control the center effectively and allows white to gain an advantage in development.",
      "better_move": "2. e5",
      "type": "strategic"
    },
    {
      "move": "3. Nf3",
      "reason": "The move Nf3 does not support the center as effectively as other options.",
      "better_move": "3. d4",
      "type": "strategic"
    },
    {
      "move": "5. exd5",
      "reason": "Exchanging the pawn reduces central control and activity.",
      "better_move": "5. Nc3",
      "type": "strategic"
    },
    {
      "move": "16. Nf6",
      "reason": "Developing the knight here misses an opportunity to pressure White's center.",
      "better_move": "16. Bd6",
      "type": "strategic"
    },
    {
      "move": "27. Ba3",
      "reason": "Misplaces the bishop, leading to a loss of initiative.",
      "better_move": "27. O-O",
      "type": "strategic"
    },
    {
      "move": "29. Qc2",
      "reason": "Weakens the pawn structure and loses control over the center.",
      "better_move": "29. Bb2",
      "type": "strategic"
    },
    {
      "move": "32. axb4",
      "reason": "Allows for a weakening of the pawn structure on the queenside.",
      "better_move": "32. h5",
      "type": "strategic"
    },
    {
      "move": "43. Qd3",
      "reason": "Allows the opponent to gain an advantage in the center and on the kingside.",
      "better_move": "43. Qe1",
      "type": "strategic"
    },
    {
      "move": "47. Rfe1",
      "reason": "Misses a tactical opportunity to exchange pawns and improve position.",
      "better_move": "47. dxe5",
      "type": "tactical"
    }
  ],
  "themes": [
    "Caro-Kann Defense",
    "Center control",
    "Pawn structure",
    "King safety",
    "Development"
  ],
  "recommendations": [
    "Focus on controlling the center with pawns and pieces early in the game.",
    "Avoid unnecessary pawn exchanges that weaken your pawn structure.",
    "Develop pieces with purpose, aiming to increase control and activity.",
    "Maintain king safety, especially when the center is open or semi-open.",
    "Consider tactical opportunities and threats before committing to moves that could weaken your position."
  ]
}